In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [56]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

DataFrame으로 위와 같은 자료를 만드시오. 컬럼 이름은 numbers, 로우 네임은 a~e, 값은 10~40

In [3]:
data = {'numbers':[10,20,30,40]}
frame = DataFrame(data, index=['a','b','c','d'])
frame

   numbers
a       10
b       20
c       30
d       40

c 로우의 값을 가져오시오.

In [4]:
frame.loc['c']

numbers    30
Name: c, dtype: int64

a,d 로우들의 값을 가져오시오.

In [5]:
frame.loc[['a','d']]

   numbers
a       10
d       40

numbers의 합을 구하시오.

In [6]:
sum(frame.numbers) #sum(frame['numbers'])

100

numbers의 값들을 각각 제곱하시오(vectorized operations 포현으로 예] 2*v)

In [7]:
frame ** 2

   numbers
a      100
b      400
c      900
d     1600

numbers의 값들을 각각 제곱하시오(apply 메서드 사용해서)

In [15]:
def func(v):
    return v ** 2
frame.apply(func)

   numbers
a      100
b      400
c      900
d     1600

numbers의 값들을 각각 제곱하시오(apply 메서드에, 람다 함수도 사용해서)

numbers.apply(f)

In [18]:
f = lambda x : x ** 2
frame.apply(f)

   numbers
a      100
b      400
c      900
d     1600

floats 라는 이름의 칼럼을 추가히시오. 값은 1.5, 2.5, 3.5, 4.5

In [19]:
# val = [1.5, 2.5, 3.5, 4.5] # 이렇게도 됨
# frame['floats'] = val

val = Series([1.5, 2.5, 3.5, 4.5], index=['a','b','c','d'])
frame['floats'] = val
frame

   numbers  floats
a       10     1.5
b       20     2.5
c       30     3.5
d       40     4.5

h) names라는 이름의 다음과 같은 칼럼을 위의 결과에 또 추가하시오.

In [20]:
# frame['names'] = Series(['Guido','Felix','Francesc','Yves'], index=["d","a","b","c"])
frame['names'] = Series(['Guido','Felix','Francesc','Yves'], index=list('dabc'))
frame

   numbers  floats     names
a       10     1.5     Felix
b       20     2.5  Francesc
c       30     3.5      Yves
d       40     4.5     Guido

i) 다음과 같은 정보를 가지는 로우(행)를 위의 결과에 추가하시오

index:z, numbers: 100, floats: 5.75, names: Henry

In [21]:
# append, ix, loc, iloc
frame.loc['z'] = [100, 5.75, 'Henry']

frame

   numbers  floats     names
a       10    1.50     Felix
b       20    2.50  Francesc
c       30    3.50      Yves
d       40    4.50     Guido
z      100    5.75     Henry

j) squares 라는 이름의 칼럼을 위의 결과에 추가하시오.
그런데 squares는 인덱스값이 짝이 맞지 않으므로 join 메서드를 사용하시오(기본옵션으로)

In [22]:
value = [1, 4, 9, 16, 25]
s_f = DataFrame(value, columns= ['squares'], index=list('abcdy') )

frame.join(s_f)

   numbers  floats     names  squares
a       10    1.50     Felix      1.0
b       20    2.50  Francesc      4.0
c       30    3.50      Yves      9.0
d       40    4.50     Guido     16.0
z      100    5.75     Henry      NaN

k) j와 동일하나 join 메서드의 옵션을 'outer'로 바꿔서 수행해보시오.

In [23]:
n_f = frame.join(s_f, how='outer')
n_f

   numbers  floats     names  squares
a     10.0    1.50     Felix      1.0
b     20.0    2.50  Francesc      4.0
c     30.0    3.50      Yves      9.0
d     40.0    4.50     Guido     16.0
y      NaN     NaN       NaN     25.0
z    100.0    5.75     Henry      NaN

l) 위의 결과로 나온 자료에서 numbers 칼럼과 squares 칼럼에 대해,
각각 평균을 구하시오. 다음과 같은 결과가 나와야 함.
(mean 메서드 사용, column-wise 계산)

In [45]:
frame2 = n_f[['numbers', 'squares']]
frame2.mean()

numbers    40.0
squares    11.0
dtype: float64

m) numbers와 squares 칼럼에 대해, 각각 표준편차를 구하시오
(std 메서드 사용, column-wise 계산)

In [47]:
frame2.std()

numbers    35.355339
squares     9.669540
dtype: float64

(pandas 기본) 문제 2. DataFrame 다루기 (2)

a) 표준정규분포를 따르는 9 X 4 형태의 DataFrame을 생성하시오

In [59]:
df = DataFrame(np.random.randn(9,4))
df

          0         1         2         3
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
3  0.274992  0.228913  1.352917  0.886429
4 -2.001637 -0.371843  1.669025 -0.438570
5 -0.539741  0.476985  3.248944 -1.021228
6 -0.577087  0.124121  0.302614  0.523772
7  0.000940  1.343810 -0.713544 -0.831154
8 -2.370232 -1.860761 -0.860757  0.560145

b) a에서 생성한 DataFrame의 칼럼 이름을 - No1, No2, No2, No4로 지정하시오

In [60]:
df.columns = ['No1', 'No2', 'No3', 'No4']
df

        No1       No2       No3       No4
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
3  0.274992  0.228913  1.352917  0.886429
4 -2.001637 -0.371843  1.669025 -0.438570
5 -0.539741  0.476985  3.248944 -1.021228
6 -0.577087  0.124121  0.302614  0.523772
7  0.000940  1.343810 -0.713544 -0.831154
8 -2.370232 -1.860761 -0.860757  0.560145

e) 위에서 생성된 자료에, 시간 관련 인덱싱을 하기 위해서는 DataTime 자료형을
생성해서 로우 인덱스에 넣어주는 방법이 있다. 아래코드를 실행하시오

      import pandas as pd 라는 가정하에.

dates = pd.date_range("2015-1-1",periods=9,freq="M")

df.index=dates   # a와 b를 거쳐서 만들어진 DataFrame 인스턴스의 변수명이 df라고 가정.

df

In [62]:
dates = pd.date_range("2015-1-1",periods=9,freq="M")
df.index=dates

df

                 No1       No2       No3       No4
2015-01-31 -0.204708  0.478943 -0.519439 -0.555730
2015-02-28  1.965781  1.393406  0.092908  0.281746
2015-03-31  0.769023  1.246435  1.007189 -1.296221
2015-04-30  0.274992  0.228913  1.352917  0.886429
2015-05-31 -2.001637 -0.371843  1.669025 -0.438570
2015-06-30 -0.539741  0.476985  3.248944 -1.021228
2015-07-31 -0.577087  0.124121  0.302614  0.523772
2015-08-31  0.000940  1.343810 -0.713544 -0.831154
2015-09-30 -2.370232 -1.860761 -0.860757  0.560145

f) 각 컬럼의 평균을 구하시오

In [64]:
df.mean()

No1   -0.298074
No2    0.340001
No3    0.619984
No4   -0.210090
dtype: float64

f) 5월부터 7월까지의, 각 컬럼의 평균을 구하시오

In [67]:
df[4:7].mean()

No1   -1.039489
No2    0.076421
No3    1.740194
No4   -0.312008
dtype: float64